IDEA StatiCa Open Model
RebarHookBend Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The RebarHookBend type exposes the following members.
Properties
Name | Description
Angle
 Bending Angle in X-Y Plane.
AxisY
 Gets or sets the position (direction) of the hook in 3D. It representa a Local Coordinate System. Hook lie in X-Y Plane. AxisX is defined by first/last segment of the rebar. AxisX and AxisY creates a plane where the hook lies.
 (Inherited from RebarHookBase.)
Length
 Length of the Hook.
Radius
 Bending Radius. It will override Vertex Radius in case of RebarArcRadVertex3D and RebarArcRadVertex3D.
Reverse
 Reverse direction of the hook
 (Inherited from RebarHookBase.)
Top
See Also
Reference
RebarHookBend Class
IdeaRS.OpenModel.Model Namespace